LogFilesWrk2/HtmlPerfectClientWrk2V1.txt
Running 5m test @ http://169.254.32.152:8181/htmlPerfect
  2 threads and 5 connections
  Thread calibration: mean lat.: 2.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.990ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.21ms    3.17ms 110.53ms   99.25%
    Req/Sec   792.80    110.13     2.00k    78.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.97ms
 75.000%    2.40ms
 90.000%    2.84ms
 99.000%    4.11ms
 99.900%   57.38ms
 99.990%   99.26ms
 99.999%  109.69ms
100.000%  110.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.712     0.000000            1         1.00
       1.198     0.100000        43632         1.11
       1.450     0.200000        87304         1.25
       1.649     0.300000       130960         1.43
       1.816     0.400000       174617         1.67
       1.966     0.500000       218191         2.00
       2.044     0.550000       240104         2.22
       2.127     0.600000       261954         2.50
       2.213     0.650000       283719         2.86
       2.303     0.700000       305489         3.33
       2.403     0.750000       327185         4.00
       2.459     0.775000       338333         4.44
       2.517     0.800000       348932         5.00
       2.583     0.825000       359986         5.71
       2.657     0.850000       370892         6.67
       2.741     0.875000       381855         8.00
       2.787     0.887500       387196         8.89
       2.837     0.900000       392573        10.00
       2.897     0.912500       398035        11.43
       2.965     0.925000       403436        13.33
       3.045     0.937500       409008        16.00
       3.091     0.943750       411707        17.78
       3.141     0.950000       414350        20.00
       3.203     0.956250       417119        22.86
       3.277     0.962500       419793        26.67
       3.363     0.968750       422584        32.00
       3.411     0.971875       423895        35.56
       3.467     0.975000       425251        40.00
       3.527     0.978125       426610        45.71
       3.605     0.981250       427970        53.33
       3.715     0.984375       429343        64.00
       3.783     0.985938       430019        71.11
       3.867     0.987500       430702        80.00
       3.991     0.989062       431379        91.43
       4.215     0.990625       432067       106.67
       4.943     0.992188       432738       128.00
       6.155     0.992969       433080       142.22
       8.003     0.993750       433419       160.00
      11.063     0.994531       433759       182.86
      14.527     0.995313       434100       213.33
      20.367     0.996094       434441       256.00
      24.047     0.996484       434611       284.44
      28.351     0.996875       434782       320.00
      32.031     0.997266       434952       365.71
      36.255     0.997656       435123       426.67
      41.663     0.998047       435293       512.00
      44.127     0.998242       435378       568.89
      47.135     0.998437       435464       640.00
      49.439     0.998633       435548       731.43
      52.447     0.998828       435634       853.33
      58.015     0.999023       435719      1024.00
      60.575     0.999121       435761      1137.78
      63.327     0.999219       435804      1280.00
      66.303     0.999316       435847      1462.86
      69.695     0.999414       435890      1706.67
      72.703     0.999512       435932      2048.00
      73.983     0.999561       435954      2275.56
      75.583     0.999609       435974      2560.00
      79.231     0.999658       435995      2925.71
      81.279     0.999707       436017      3413.33
      86.911     0.999756       436038      4096.00
      89.151     0.999780       436049      4551.11
      91.455     0.999805       436059      5120.00
      93.695     0.999829       436070      5851.43
      96.319     0.999854       436081      6826.67
      97.791     0.999878       436091      8192.00
      99.071     0.999890       436097      9102.22
     100.287     0.999902       436103     10240.00
     100.927     0.999915       436107     11702.86
     102.015     0.999927       436113     13653.33
     103.423     0.999939       436118     16384.00
     104.191     0.999945       436121     18204.44
     104.511     0.999951       436123     20480.00
     105.279     0.999957       436126     23405.71
     105.983     0.999963       436129     27306.67
     106.623     0.999969       436131     32768.00
     107.455     0.999973       436133     36408.89
     107.839     0.999976       436135     40960.00
     107.839     0.999979       436135     46811.43
     108.735     0.999982       436138     54613.33
     108.735     0.999985       436138     65536.00
     109.439     0.999986       436139     72817.78
     109.439     0.999988       436139     81920.00
     109.695     0.999989       436141     93622.86
     109.695     0.999991       436141    109226.67
     109.695     0.999992       436141    131072.00
     109.951     0.999993       436142    145635.56
     109.951     0.999994       436142    163840.00
     109.951     0.999995       436142    187245.71
     110.399     0.999995       436143    218453.33
     110.399     0.999996       436143    262144.00
     110.399     0.999997       436143    291271.11
     110.399     0.999997       436143    327680.00
     110.399     0.999997       436143    374491.43
     110.591     0.999998       436144    436906.67
     110.591     1.000000       436144          inf
#[Mean    =        2.206, StdDeviation   =        3.174]
#[Max     =      110.528, Total count    =       436144]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  451194 requests in 5.00m, 639.41MB read
Requests/sec:   1504.00
Transfer/sec:      2.13MB

 >> |2017/09/08 16:45:28|HtmlPerfectClientWrk2V1|Perfect HTML benchmarking
wrk2 -t2 -d5m -c5 --latency -R1505 --timeout 100s http://169.254.32.152:8181/htmlPerfect